Tekla.Structures.ModelInternal.SharedModel
Implements Tekla.Structures.Model.ISharedModel.

Tekla.Structures.ModelInternal.SharedModel.Id


Tekla.Structures.ModelInternal.SharedModel.Name


Tekla.Structures.ModelInternal.SharedModel.Code


Tekla.Structures.ModelInternal.SharedModel.Description


Tekla.Structures.ModelInternal.SharedModel.Owner


Tekla.Structures.ModelInternal.SharedModel.CreatedAt


Tekla.Structures.ModelInternal.SharedModel.CurrentUserRole
